{
    "High School Student": "A 16-year-old student who often waits after school for their parents to pick them up. They’re usually tired from sports practice or study sessions and crave quick energy. Their friends often hang around the machine too, and peer influence pushes them toward candy bars and sodas. Money is tight — they usually have coins from lunch change, which limits what they can buy. Because of this, they gravitate toward the most filling or colorful options that feel like a treat.",
    "College Athlete": "A 20-year-old runner balancing training, classes, and a part-time job. They’ve been advised by their coach to eat high-protein snacks, but convenience often wins when they’re running between lectures. They’re conscious about sugar but sometimes rationalize a soda as “extra carbs” before practice. Their budget is limited to what fits in a student lifestyle, so they try to maximize value per dollar. If healthier options are missing, they compromise and grab something light but satisfying.",
    "Night Shift Worker": "A 35-year-old security guard working long shifts at a downtown office building. Cafeterias and coffee shops are closed by the time their breaks come around, so the vending machine is one of their few food sources. They rely on caffeine to fight fatigue, often grabbing energy drinks or strong sodas. Budget isn’t their top concern — staying awake and alert is. Over time, they’ve developed a habit of pairing caffeine with something salty to stay full through the night.",
    "Busy Parent": "A 40-year-old parent juggling two kids’ after-school activities. They often find themselves waiting in gyms, fields, or lobbies, where the vending machine is the only option. They want to model healthier choices but also need something fast, usually granola bars or bottled water. Still, when stressed or short on sleep, they indulge in candy or chips without thinking twice. Price matters, but convenience and speed usually outweigh cost. Sometimes they pick a snack to share with their child as a small bonding moment.",
    "Retiree on the Go": "A 67-year-old retiree who enjoys community activities like bingo, walking clubs, and library meetups. They don’t need vending machines for meals but see them as small luxuries. Snacks remind them of simpler times, so they often choose cookies, crackers, or juices. They live on a fixed income, so they’re mindful of spending, but an occasional $1–2 treat feels justifiable. Their slower pace means they actually enjoy browsing the machine before making a decision.",
    "Tech Startup Employee": "A 29-year-old working long hours at a fast-paced startup, often skipping meals. Their office has a vending machine stocked with quick snacks and drinks, which they visit multiple times a day. They pay with a card, barely noticing the cost, since convenience is everything during crunch time. Their choices lean heavily toward caffeinated drinks, chips, and candy for quick energy. They’re impulsive and stress-driven, and sometimes joke with coworkers about “living off the vending machine.”",
    "Health-Conscious Gym-Goer": "A 24-year-old fitness enthusiast who lifts weights five days a week. They are very particular about nutrition, preferring protein-rich snacks, nuts, or water over sugary options. They scrutinize vending machines for healthier alternatives and often feel disappointed by the lack of them. When temptation wins, they justify indulgence as a “cheat” to balance out their strict routine. Their gym membership and disciplined lifestyle make them highly selective and self-critical about food.",
    "Middle School Teacher": "A 45-year-old teacher with a hectic schedule and short breaks between classes. They’re constantly on their feet, and the vending machine offers quick relief during a busy day. Coffee-based drinks or small chocolates are their go-to for a fast energy boost. They don’t linger or browse — their choices are shaped by speed and availability. They often keep an eye on cost, since vending purchases can add up over the school year, but in stressful moments, convenience trumps frugality.",
    "Frequent Traveler": "A 52-year-old sales consultant who spends much of their time in airports, hotels, and conference centers. They see vending machines as reliable sources of comfort when on the road, especially in unfamiliar places. Familiar brands feel safe and reassuring, so they often buy name-brand sodas, chips, or candy. Their company covers expenses, so they’re less concerned about price and more about convenience. Traveling alone often makes them treat vending snacks as small companions during long waits.",
    "Jordan": "Jordan is a 27-year-old office worker who often grabs quick snacks and drinks from the vending machine during long afternoons at work. They’re a bit price-sensitive, usually carrying a mental budget of just a few dollars, but they still enjoy treating themselves when stressed. Jordan has a mild sweet tooth and tends to gravitate toward sodas or candy bars, though they sometimes feel guilty and consider healthier options. They’re a creature of habit but occasionally like to try something new if it catches their eye. Jordan is generally polite but can get impatient if the machine is slow or an item is out of stock."
  }